:PROPERTIES:
:ID:       bb201915-d4d8-41d1-bf66-3b93bebd5ff3
:END:
#+title: 内联命名空间
#+filetags: cpp

* 内联命名空间 [[https://www.learncpp.com/cpp-tutorial/unnamed-and-inline-namespaces/][learncpp7.14]]
1. 用于 *版本控制* ：默认使用最新版本（内联版本）；类似 [[id:6b7beb8f-fac9-4651-bc19-ef423f8f7a4d][匿名命名空间]]：声明的标识符属于父命名空间，但是 *不具有内部链接性*
   #+begin_src cpp :results output :namespaces std :includes <iostream>
   inline namespace V1 // declare an inline namespace named V1
   {
       void doSomething()
       {
           std::cout << "V1\n";
       }
   }

   namespace V2 // declare a normal namespace named V2
   {
       void doSomething()
       {
           std::cout << "V2\n";
       }
   }

   int main()
   {
       V1::doSomething(); // calls the V1 version of doSomething()
       V2::doSomething(); // calls the V2 version of doSomething()

       doSomething(); // calls the inline version of doSomething() (which is V1)

       return 0;
   }
   #+end_src

   #+RESULTS:
   : V1
   : V2
   : V1
